README.tex
% Created 2019-03-01 Fri 08:39
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[T1]{fontenc}
\usepackage[letterpaper]{geometry}
\geometry{verbose,tmargin=0.8in,bmargin=0.6in,lmargin=0.75in,rmargin=0.75in}
\setlength{\parskip}{\medskipamount}
\setlength{\parindent}{0pt}
\author{Keith Lancaster}
\date{\today}
\title{CIS 4339 Practice Exam 1 S2019}
\hypersetup{
 pdfauthor={Keith Lancaster},
 pdftitle={CIS 4339 Practice Exam 1 S2019},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\maketitle


\section*{Practice Exam Coding Portion}
\label{sec:orgb437057}
\subsection*{Debugging}
\label{sec:orgca5b745}
\begin{itemize}
\item Go through the entire app. You will encounter at least one error page. Fix the problem(s) that is(are) creating error(s).
\end{itemize}
\subsection*{Adding Features}
\label{sec:orgb12546b}
\begin{enumerate}
\item Add a div with an embedded h1 tag that will appear at the top of every page. In the h1 tag, put "Exam 1: (Your Full Name)"
\item Add a field called "Description" to the Category model, making all the
necessary changes to allow the field to show up in the list of categories,
on a single category page, and of course in the form so that a user can
edit the category description.
\begin{itemize}
\item HINT: Do not forget about the whitelist!
\end{itemize}
\end{enumerate}

BONUS: Style the header div created in Problem 1 with CSS by giving it a background color and a black border. 

\section*{Written Portion Topics for Review}
\label{sec:org335857e}
\subsection*{Ruby}
\label{sec:org92cf6e9}
\begin{itemize}
\item hashes
\item arrays
\item string operations
\begin{itemize}
\item example:
\begin{verbatim}
myvar = "John"
mymessage = "My name is #{myvar}"
\end{verbatim}
\end{itemize}
\end{itemize}
\subsection*{Rails}
\label{sec:orgc5999e5}
\begin{itemize}
\item Model-view-controller pattern
\item The routes.rb file and its uses
\item Migrations
\end{itemize}
\end{document}
